# Permeability Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..Permeability Property
SpecTypeId Class See Also
---
Permeability, in discipline Energy.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Permeability { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Permeability As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Permeability {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace